/* automatically generated by rust-bindgen 0.69.1 */

#[doc = " @defgroup LLVMCSupportTypes Types and Enumerations\n\n @{"]
pub type LLVMBool = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LLVMOpaqueMemoryBuffer {
    _unused: [u8; 0],
}
#[doc = " Used to pass regions of memory through LLVM interfaces.\n\n @see llvm::MemoryBuffer"]
pub type LLVMMemoryBufferRef = *mut LLVMOpaqueMemoryBuffer;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LLVMOpaqueContext {
    _unused: [u8; 0],
}
#[doc = " The top-level container for all LLVM global data. See the LLVMContext class."]
pub type LLVMContextRef = *mut LLVMOpaqueContext;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LLVMOpaqueModule {
    _unused: [u8; 0],
}
#[doc = " The top-level container for all other LLVM Intermediate Representation (IR)\n objects.\n\n @see llvm::Module"]
pub type LLVMModuleRef = *mut LLVMOpaqueModule;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LLVMOpaqueType {
    _unused: [u8; 0],
}
#[doc = " Each value in the LLVM IR has a type, an LLVMTypeRef.\n\n @see llvm::Type"]
pub type LLVMTypeRef = *mut LLVMOpaqueType;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LLVMOpaqueValue {
    _unused: [u8; 0],
}
#[doc = " Represents an individual value in LLVM IR.\n\n This models llvm::Value."]
pub type LLVMValueRef = *mut LLVMOpaqueValue;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LLVMOpaqueBasicBlock {
    _unused: [u8; 0],
}

pub type LLVMTargetLibraryInfoRef = *mut LLVMOpaqueTargetLibraryInfotData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LLVMOpaqueTargetMachine {
    _unused: [u8; 0],
}
#[doc = " @addtogroup LLVMCTarget\n\n @{"]
pub type LLVMTargetMachineRef = *mut LLVMOpaqueTargetMachine;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LLVMTarget {
    _unused: [u8; 0],
}
pub type LLVMTargetRef = *mut LLVMTarget;
pub const LLVMCodeGenOptLevel_LLVMCodeGenLevelNone: LLVMCodeGenOptLevel = 0;
pub const LLVMCodeGenOptLevel_LLVMCodeGenLevelLess: LLVMCodeGenOptLevel = 1;
pub const LLVMCodeGenOptLevel_LLVMCodeGenLevelDefault: LLVMCodeGenOptLevel = 2;
pub const LLVMCodeGenOptLevel_LLVMCodeGenLevelAggressive: LLVMCodeGenOptLevel = 3;
pub type LLVMCodeGenOptLevel = ::std::os::raw::c_int;
pub const LLVMRelocMode_LLVMRelocDefault: LLVMRelocMode = 0;
pub const LLVMRelocMode_LLVMRelocStatic: LLVMRelocMode = 1;
pub const LLVMRelocMode_LLVMRelocPIC: LLVMRelocMode = 2;
pub const LLVMRelocMode_LLVMRelocDynamicNoPic: LLVMRelocMode = 3;
pub const LLVMRelocMode_LLVMRelocROPI: LLVMRelocMode = 4;
pub const LLVMRelocMode_LLVMRelocRWPI: LLVMRelocMode = 5;
pub const LLVMRelocMode_LLVMRelocROPI_RWPI: LLVMRelocMode = 6;
pub type LLVMRelocMode = ::std::os::raw::c_int;
pub const LLVMCodeModel_LLVMCodeModelDefault: LLVMCodeModel = 0;
pub const LLVMCodeModel_LLVMCodeModelJITDefault: LLVMCodeModel = 1;
pub const LLVMCodeModel_LLVMCodeModelTiny: LLVMCodeModel = 2;
pub const LLVMCodeModel_LLVMCodeModelSmall: LLVMCodeModel = 3;
pub const LLVMCodeModel_LLVMCodeModelKernel: LLVMCodeModel = 4;
pub const LLVMCodeModel_LLVMCodeModelMedium: LLVMCodeModel = 5;
pub const LLVMCodeModel_LLVMCodeModelLarge: LLVMCodeModel = 6;
pub type LLVMCodeModel = ::std::os::raw::c_int;
pub const LLVMCodeGenFileType_LLVMAssemblyFile: LLVMCodeGenFileType = 0;
pub const LLVMCodeGenFileType_LLVMObjectFile: LLVMCodeGenFileType = 1;
pub type LLVMCodeGenFileType = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LLVMOpaqueGenericValue {
    _unused: [u8; 0],
}
pub type LLVMGenericValueRef = *mut LLVMOpaqueGenericValue;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LLVMOpaqueExecutionEngine {
    _unused: [u8; 0],
}
pub type LLVMExecutionEngineRef = *mut LLVMOpaqueExecutionEngine;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LLVMOpaqueMCJITMemoryManager {
    _unused: [u8; 0],
}
pub type LLVMMCJITMemoryManagerRef = *mut LLVMOpaqueMCJITMemoryManager;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LLVMMCJITCompilerOptions {
    pub OptLevel: ::std::os::raw::c_uint,
    pub CodeModel: LLVMCodeModel,
    pub NoFramePointerElim: LLVMBool,
    pub EnableFastISel: LLVMBool,
    pub MCJMM: LLVMMCJITMemoryManagerRef,
}
#[test]
fn bindgen_test_layout_LLVMMCJITCompilerOptions() {
    const UNINIT: ::std::mem::MaybeUninit<LLVMMCJITCompilerOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<LLVMMCJITCompilerOptions>(),
        24usize,
        concat!("Size of: ", stringify!(LLVMMCJITCompilerOptions))
    );
    assert_eq!(
        ::std::mem::align_of::<LLVMMCJITCompilerOptions>(),
        8usize,
        concat!("Alignment of ", stringify!(LLVMMCJITCompilerOptions))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OptLevel) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LLVMMCJITCompilerOptions),
            "::",
            stringify!(OptLevel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CodeModel) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(LLVMMCJITCompilerOptions),
            "::",
            stringify!(CodeModel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NoFramePointerElim) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(LLVMMCJITCompilerOptions),
            "::",
            stringify!(NoFramePointerElim)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EnableFastISel) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(LLVMMCJITCompilerOptions),
            "::",
            stringify!(EnableFastISel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MCJMM) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(LLVMMCJITCompilerOptions),
            "::",
            stringify!(MCJMM)
        )
    );
}
pub type LLVMMemoryManagerAllocateCodeSectionCallback = ::std::option::Option<
    unsafe extern "C" fn(
        Opaque: *mut ::std::os::raw::c_void,
        Size: usize,
        Alignment: ::std::os::raw::c_uint,
        SectionID: ::std::os::raw::c_uint,
        SectionName: *const ::std::os::raw::c_char,
    ) -> *mut u8,
>;
pub type LLVMMemoryManagerAllocateDataSectionCallback = ::std::option::Option<
    unsafe extern "C" fn(
        Opaque: *mut ::std::os::raw::c_void,
        Size: usize,
        Alignment: ::std::os::raw::c_uint,
        SectionID: ::std::os::raw::c_uint,
        SectionName: *const ::std::os::raw::c_char,
        IsReadOnly: LLVMBool,
    ) -> *mut u8,
>;
pub type LLVMMemoryManagerFinalizeMemoryCallback = ::std::option::Option<
    unsafe extern "C" fn(
        Opaque: *mut ::std::os::raw::c_void,
        ErrMsg: *mut *mut ::std::os::raw::c_char,
    ) -> LLVMBool,
>;
pub type LLVMMemoryManagerDestroyCallback =
    ::std::option::Option<unsafe extern "C" fn(Opaque: *mut ::std::os::raw::c_void)>;
#[doc = " Represents an address in the executor process."]
pub type LLVMOrcJITTargetAddress = u64;
#[doc = " Represents an address in the executor process."]
pub type LLVMOrcExecutorAddress = u64;
#[doc = " Represents the linkage flags for a symbol definition."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LLVMJITSymbolFlags {
    pub GenericFlags: u8,
    pub TargetFlags: u8,
}
#[test]
fn bindgen_test_layout_LLVMJITSymbolFlags() {
    const UNINIT: ::std::mem::MaybeUninit<LLVMJITSymbolFlags> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<LLVMJITSymbolFlags>(),
        2usize,
        concat!("Size of: ", stringify!(LLVMJITSymbolFlags))
    );
    assert_eq!(
        ::std::mem::align_of::<LLVMJITSymbolFlags>(),
        1usize,
        concat!("Alignment of ", stringify!(LLVMJITSymbolFlags))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GenericFlags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LLVMJITSymbolFlags),
            "::",
            stringify!(GenericFlags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TargetFlags) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(LLVMJITSymbolFlags),
            "::",
            stringify!(TargetFlags)
        )
    );
}
#[doc = " Represents an evaluated symbol address and flags."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LLVMJITEvaluatedSymbol {
    pub Address: LLVMOrcExecutorAddress,
    pub Flags: LLVMJITSymbolFlags,
}
#[test]
fn bindgen_test_layout_LLVMJITEvaluatedSymbol() {
    const UNINIT: ::std::mem::MaybeUninit<LLVMJITEvaluatedSymbol> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<LLVMJITEvaluatedSymbol>(),
        16usize,
        concat!("Size of: ", stringify!(LLVMJITEvaluatedSymbol))
    );
    assert_eq!(
        ::std::mem::align_of::<LLVMJITEvaluatedSymbol>(),
        8usize,
        concat!("Alignment of ", stringify!(LLVMJITEvaluatedSymbol))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Address) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LLVMJITEvaluatedSymbol),
            "::",
            stringify!(Address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Flags) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(LLVMJITEvaluatedSymbol),
            "::",
            stringify!(Flags)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LLVMOrcOpaqueExecutionSession {
    _unused: [u8; 0],
}
#[doc = " A reference to an orc::ExecutionSession instance."]
pub type LLVMOrcExecutionSessionRef = *mut LLVMOrcOpaqueExecutionSession;
#[doc = " Error reporter function."]
pub type LLVMOrcErrorReporterFunction = ::std::option::Option<
    unsafe extern "C" fn(Ctx: *mut ::std::os::raw::c_void, err: LLVMErrorRef),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LLVMOrcOpaqueSymbolStringPool {
    _unused: [u8; 0],
}
#[doc = " A reference to an orc::SymbolStringPool."]
pub type LLVMOrcSymbolStringPoolRef = *mut LLVMOrcOpaqueSymbolStringPool;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LLVMOrcOpaqueSymbolStringPoolEntry {
    _unused: [u8; 0],
}
#[doc = " A reference to an orc::SymbolStringPool table entry."]
pub type LLVMOrcSymbolStringPoolEntryRef = *mut LLVMOrcOpaqueSymbolStringPoolEntry;
#[doc = " Represents a pair of a symbol name and LLVMJITSymbolFlags."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LLVMOrcCSymbolFlagsMapPair {
    pub Name: LLVMOrcSymbolStringPoolEntryRef,
    pub Flags: LLVMJITSymbolFlags,
}
#[test]
fn bindgen_test_layout_LLVMOrcCSymbolFlagsMapPair() {
    const UNINIT: ::std::mem::MaybeUninit<LLVMOrcCSymbolFlagsMapPair> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<LLVMOrcCSymbolFlagsMapPair>(),
        16usize,
        concat!("Size of: ", stringify!(LLVMOrcCSymbolFlagsMapPair))
    );
    assert_eq!(
        ::std::mem::align_of::<LLVMOrcCSymbolFlagsMapPair>(),
        8usize,
        concat!("Alignment of ", stringify!(LLVMOrcCSymbolFlagsMapPair))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LLVMOrcCSymbolFlagsMapPair),
            "::",
            stringify!(Name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Flags) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(LLVMOrcCSymbolFlagsMapPair),
            "::",
            stringify!(Flags)
        )
    );
}
#[doc = " Represents a list of (SymbolStringPtr, JITSymbolFlags) pairs that can be used\n to construct a SymbolFlagsMap."]
pub type LLVMOrcCSymbolFlagsMapPairs = *mut LLVMOrcCSymbolFlagsMapPair;
#[doc = " Represents a pair of a symbol name and an evaluated symbol."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LLVMOrcCSymbolMapPair {
    pub Name: LLVMOrcSymbolStringPoolEntryRef,
    pub Sym: LLVMJITEvaluatedSymbol,
}
#[test]
fn bindgen_test_layout_LLVMOrcCSymbolMapPair() {
    const UNINIT: ::std::mem::MaybeUninit<LLVMOrcCSymbolMapPair> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<LLVMOrcCSymbolMapPair>(),
        24usize,
        concat!("Size of: ", stringify!(LLVMOrcCSymbolMapPair))
    );
    assert_eq!(
        ::std::mem::align_of::<LLVMOrcCSymbolMapPair>(),
        8usize,
        concat!("Alignment of ", stringify!(LLVMOrcCSymbolMapPair))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LLVMOrcCSymbolMapPair),
            "::",
            stringify!(Name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Sym) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(LLVMOrcCSymbolMapPair),
            "::",
            stringify!(Sym)
        )
    );
}
#[doc = " Represents a list of (SymbolStringPtr, JITEvaluatedSymbol) pairs that can be\n used to construct a SymbolMap."]
pub type LLVMOrcCSymbolMapPairs = *mut LLVMOrcCSymbolMapPair;
#[doc = " Represents a SymbolAliasMapEntry"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LLVMOrcCSymbolAliasMapEntry {
    pub Name: LLVMOrcSymbolStringPoolEntryRef,
    pub Flags: LLVMJITSymbolFlags,
}
#[test]
fn bindgen_test_layout_LLVMOrcCSymbolAliasMapEntry() {
    const UNINIT: ::std::mem::MaybeUninit<LLVMOrcCSymbolAliasMapEntry> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<LLVMOrcCSymbolAliasMapEntry>(),
        16usize,
        concat!("Size of: ", stringify!(LLVMOrcCSymbolAliasMapEntry))
    );
    assert_eq!(
        ::std::mem::align_of::<LLVMOrcCSymbolAliasMapEntry>(),
        8usize,
        concat!("Alignment of ", stringify!(LLVMOrcCSymbolAliasMapEntry))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LLVMOrcCSymbolAliasMapEntry),
            "::",
            stringify!(Name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Flags) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(LLVMOrcCSymbolAliasMapEntry),
            "::",
            stringify!(Flags)
        )
    );
}
#[doc = " Represents a pair of a symbol name and SymbolAliasMapEntry."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LLVMOrcCSymbolAliasMapPair {
    pub Name: LLVMOrcSymbolStringPoolEntryRef,
    pub Entry: LLVMOrcCSymbolAliasMapEntry,
}
#[test]
fn bindgen_test_layout_LLVMOrcCSymbolAliasMapPair() {
    const UNINIT: ::std::mem::MaybeUninit<LLVMOrcCSymbolAliasMapPair> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<LLVMOrcCSymbolAliasMapPair>(),
        24usize,
        concat!("Size of: ", stringify!(LLVMOrcCSymbolAliasMapPair))
    );
    assert_eq!(
        ::std::mem::align_of::<LLVMOrcCSymbolAliasMapPair>(),
        8usize,
        concat!("Alignment of ", stringify!(LLVMOrcCSymbolAliasMapPair))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LLVMOrcCSymbolAliasMapPair),
            "::",
            stringify!(Name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Entry) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(LLVMOrcCSymbolAliasMapPair),
            "::",
            stringify!(Entry)
        )
    );
}
#[doc = " Represents a list of (SymbolStringPtr, (SymbolStringPtr, JITSymbolFlags))\n pairs that can be used to construct a SymbolFlagsMap."]
pub type LLVMOrcCSymbolAliasMapPairs = *mut LLVMOrcCSymbolAliasMapPair;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LLVMOrcOpaqueJITDylib {
    _unused: [u8; 0],
}
#[doc = " A reference to an orc::JITDylib instance."]
pub type LLVMOrcJITDylibRef = *mut LLVMOrcOpaqueJITDylib;
#[doc = " Represents a list of LLVMOrcSymbolStringPoolEntryRef and the associated\n length."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LLVMOrcCSymbolsList {
    pub Symbols: *mut LLVMOrcSymbolStringPoolEntryRef,
    pub Length: usize,
}
#[test]
fn bindgen_test_layout_LLVMOrcCSymbolsList() {
    const UNINIT: ::std::mem::MaybeUninit<LLVMOrcCSymbolsList> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<LLVMOrcCSymbolsList>(),
        16usize,
        concat!("Size of: ", stringify!(LLVMOrcCSymbolsList))
    );
    assert_eq!(
        ::std::mem::align_of::<LLVMOrcCSymbolsList>(),
        8usize,
        concat!("Alignment of ", stringify!(LLVMOrcCSymbolsList))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Symbols) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LLVMOrcCSymbolsList),
            "::",
            stringify!(Symbols)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Length) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(LLVMOrcCSymbolsList),
            "::",
            stringify!(Length)
        )
    );
}
#[doc = " Represents a pair of a JITDylib and LLVMOrcCSymbolsList."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LLVMOrcCDependenceMapPair {
    pub JD: LLVMOrcJITDylibRef,
    pub Names: LLVMOrcCSymbolsList,
}
#[test]
fn bindgen_test_layout_LLVMOrcCDependenceMapPair() {
    const UNINIT: ::std::mem::MaybeUninit<LLVMOrcCDependenceMapPair> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<LLVMOrcCDependenceMapPair>(),
        24usize,
        concat!("Size of: ", stringify!(LLVMOrcCDependenceMapPair))
    );
    assert_eq!(
        ::std::mem::align_of::<LLVMOrcCDependenceMapPair>(),
        8usize,
        concat!("Alignment of ", stringify!(LLVMOrcCDependenceMapPair))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).JD) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LLVMOrcCDependenceMapPair),
            "::",
            stringify!(JD)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Names) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(LLVMOrcCDependenceMapPair),
            "::",
            stringify!(Names)
        )
    );
}
#[doc = " Represents a list of (JITDylibRef, (LLVMOrcSymbolStringPoolEntryRef*,\n size_t)) pairs that can be used to construct a SymbolDependenceMap."]
pub type LLVMOrcCDependenceMapPairs = *mut LLVMOrcCDependenceMapPair;
pub const LLVMOrcLookupKind_LLVMOrcLookupKindStatic: LLVMOrcLookupKind = 0;
pub const LLVMOrcLookupKind_LLVMOrcLookupKindDLSym: LLVMOrcLookupKind = 1;
#[doc = " Lookup kind. This can be used by definition generators when deciding whether\n to produce a definition for a requested symbol.\n\n This enum should be kept in sync with llvm::orc::LookupKind."]
pub type LLVMOrcLookupKind = ::std::os::raw::c_int;
pub const LLVMOrcJITDylibLookupFlags_LLVMOrcJITDylibLookupFlagsMatchExportedSymbolsOnly:
    LLVMOrcJITDylibLookupFlags = 0;
pub const LLVMOrcJITDylibLookupFlags_LLVMOrcJITDylibLookupFlagsMatchAllSymbols:
    LLVMOrcJITDylibLookupFlags = 1;
#[doc = " JITDylib lookup flags. This can be used by definition generators when\n deciding whether to produce a definition for a requested symbol.\n\n This enum should be kept in sync with llvm::orc::JITDylibLookupFlags."]
pub type LLVMOrcJITDylibLookupFlags = ::std::os::raw::c_int;
#[doc = " An element type for a JITDylib search order."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LLVMOrcCJITDylibSearchOrderElement {
    pub JD: LLVMOrcJITDylibRef,
    pub JDLookupFlags: LLVMOrcJITDylibLookupFlags,
}
#[test]
fn bindgen_test_layout_LLVMOrcCJITDylibSearchOrderElement() {
    const UNINIT: ::std::mem::MaybeUninit<LLVMOrcCJITDylibSearchOrderElement> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<LLVMOrcCJITDylibSearchOrderElement>(),
        16usize,
        concat!("Size of: ", stringify!(LLVMOrcCJITDylibSearchOrderElement))
    );
    assert_eq!(
        ::std::mem::align_of::<LLVMOrcCJITDylibSearchOrderElement>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(LLVMOrcCJITDylibSearchOrderElement)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).JD) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LLVMOrcCJITDylibSearchOrderElement),
            "::",
            stringify!(JD)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).JDLookupFlags) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(LLVMOrcCJITDylibSearchOrderElement),
            "::",
            stringify!(JDLookupFlags)
        )
    );
}
#[doc = " A JITDylib search order.\n\n The list is terminated with an element containing a null pointer for the JD\n field."]
pub type LLVMOrcCJITDylibSearchOrder = *mut LLVMOrcCJITDylibSearchOrderElement;
pub const LLVMOrcSymbolLookupFlags_LLVMOrcSymbolLookupFlagsRequiredSymbol:
    LLVMOrcSymbolLookupFlags = 0;
pub const LLVMOrcSymbolLookupFlags_LLVMOrcSymbolLookupFlagsWeaklyReferencedSymbol:
    LLVMOrcSymbolLookupFlags = 1;
#[doc = " Symbol lookup flags for lookup sets. This should be kept in sync with\n llvm::orc::SymbolLookupFlags."]
pub type LLVMOrcSymbolLookupFlags = ::std::os::raw::c_int;
#[doc = " An element type for a symbol lookup set."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LLVMOrcCLookupSetElement {
    pub Name: LLVMOrcSymbolStringPoolEntryRef,
    pub LookupFlags: LLVMOrcSymbolLookupFlags,
}
#[test]
fn bindgen_test_layout_LLVMOrcCLookupSetElement() {
    const UNINIT: ::std::mem::MaybeUninit<LLVMOrcCLookupSetElement> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<LLVMOrcCLookupSetElement>(),
        16usize,
        concat!("Size of: ", stringify!(LLVMOrcCLookupSetElement))
    );
    assert_eq!(
        ::std::mem::align_of::<LLVMOrcCLookupSetElement>(),
        8usize,
        concat!("Alignment of ", stringify!(LLVMOrcCLookupSetElement))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LLVMOrcCLookupSetElement),
            "::",
            stringify!(Name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LookupFlags) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(LLVMOrcCLookupSetElement),
            "::",
            stringify!(LookupFlags)
        )
    );
}
#[doc = " A set of symbols to look up / generate.\n\n The list is terminated with an element containing a null pointer for the\n Name field.\n\n If a client creates an instance of this type then they are responsible for\n freeing it, and for ensuring that all strings have been retained over the\n course of its life. Clients receiving a copy from a callback are not\n responsible for managing lifetime or retain counts."]
pub type LLVMOrcCLookupSet = *mut LLVMOrcCLookupSetElement;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LLVMOrcOpaqueMaterializationUnit {
    _unused: [u8; 0],
}
#[doc = " A reference to a uniquely owned orc::MaterializationUnit instance."]
pub type LLVMOrcMaterializationUnitRef = *mut LLVMOrcOpaqueMaterializationUnit;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LLVMOrcOpaqueMaterializationResponsibility {
